# Stf Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Stf Property
SymbolTypeId Class See Also
---
Symbol STf, indicating unit US tonnes force.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Stf { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Stf As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Stf {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace